DataProcessors/ОтчетПродажиИВозвраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ОтчетПродажиИВозвраты</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ОС_ДанныеПродажДляМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОС_ДанныеПродажДляМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПродажиКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажиСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозвратыКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозвратыСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ОтчетПродажиИВозвраты/Forms/Форма_Первоначальная/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Контрагент = Параметры.Контрагент;
	СформироватьОтчет();
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет ()
	Запрос       = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеПродаж.Номенклатура КАК Номенклатура,
	|	ДанныеПродаж.Дата КАК Дата,
	|	ДанныеПродаж.ПродажиСумма КАК Продажи,
	|	ДанныеПродаж.ВозвратыСумма КАК Возвраты,
	|	ДанныеПродаж.ВозвратыКоличество,
	|	ДанныеПродаж.ПродажиКоличество
	|ИЗ
	|	РегистрСведений.ОС_ДанныеПродажДляМП КАК ДанныеПродаж
	|ГДЕ
	|	ДанныеПродаж.Контрагент = &Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ,
	|	Номенклатура
	|ИТОГИ ПО
	|	Дата";
	Запрос.УстановитьПараметр("Контрагент" ,Контрагент);
	
	ИтогПродажи  = 0;
	ИтогВозвраты = 0;
	
	Результат.Очистить();
	
	СЧ = 5;
	ВыборкаДата = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДата.Следующий() Цикл
		СЧ = СЧ - 1;	
		Если СЧ = 0 Тогда
			Прервать;
		КонецЕсли;	
		ВыборкаНоменклатура = ВыборкаДата.Выбрать();
		Пока ВыборкаНоменклатура.Следующий() Цикл
			СтруктураПоиска = Новый Структура("Номенклатура",ВыборкаНоменклатура.Номенклатура);
			ИскомыеСтроки   = Результат.НайтиСтроки(СтруктураПоиска);
			Если ИскомыеСтроки.Количество() > 0 Тогда
				ИскомаяСтрока = ИскомыеСтроки[0];
			Иначе
				ИскомаяСтрока = Результат.Добавить();
				ЗаполнитьЗначенияСвойств(ИскомаяСтрока,СтруктураПоиска);
			КонецЕсли;
			ИскомаяСтрока["ПродажиВозвраты" + СЧ] = Формат(ВыборкаНоменклатура.ПродажиКоличество,"ЧДЦ=; ЧН=0; ЧГ=0") + "/" + Формат(ВыборкаНоменклатура.ВозвратыКоличество,"ЧДЦ=; ЧН=0; ЧГ=0");
			ИтогПродажи  = ИтогПродажи  + ВыборкаНоменклатура.Продажи; 
			ИтогВозвраты = ИтогВозвраты + ВыборкаНоменклатура.Возвраты; 
		КонецЦикла;	
	КонецЦикла;	
	
	Результат.Сортировать("Номенклатура");
	
	Для Каждого СтрокаТЧ Из Результат Цикл
		Для СЧ = 1 По 4 Цикл
			Если СтрокаТЧ["ПродажиВозвраты" + СЧ] = "" Тогда
				СтрокаТЧ["ПродажиВозвраты" + СЧ] = "0/0";	
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
		Элементы.ДекорацияНетДанных.Заголовок = "<< НЕТ ДАННЫХ >>";
	Иначе
		Элементы.ДекорацияНетДанных.Заголовок = "Итого: " + ИтогПродажи + " - " + (-ИтогВозвраты) + " = " + (ИтогПродажи + ИтогВозвраты) + " р.";
	КонецЕсли;	
КонецПроцедуры
